tutorials/ocmfMassTransferDns/NaCl_nG989_C5_P30_J60_Lx5_Ly1_Lz25/constant/simulationConditions
// Case: nRa1230_NaCl_P30bar_J60LMH_C5kgm3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      simulationConditions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//Ah          1.1e-11;
Jv          1.67e-05;
rRef        0.0762;
Robs        1.0;
CA0         5.0;

RTobs       1.0;
CT0         0.001;


Pref        3.0e6;
RPM         12876;


// ************************************************************************* //
